In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

# How many distinct (different) actors' last names are there?

In [5]:
query1 = 'SELECT DISTINCT (last_name) FROM sakila.actor ORDER BY last_name ASC'
print(query1)
data = pd.read_sql_query(query1, engine)
data.head()

SELECT DISTINCT (last_name) FROM sakila.actor ORDER BY last_name ASC

  last_name
0    AKROYD
1     ALLEN
2   ASTAIRE
3    BACALL
4    BAILEY

# Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [6]:
query2 = '''SELECT *, date_format(rental_date, '%%W') AS 'day_type',
		CASE
        WHEN date_format(rental_date, '%%W') = 'saturday' OR date_format(rental_date, '%%W') = 'sunday' then 'weekend' 
        ELSE 'workday'
        END AS 'day'
FROM rental;'''
data2 = pd.read_sql_query(query2, engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type,day
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Tuesday,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Tuesday,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Tuesday,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Tuesday,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Tuesday,workday

# Get all films with ARMAGEDDON in the title.

In [7]:
query3 = '''SELECT title, film_id
FROM film
WHERE title like '%%ARMAGEDDON%%';'''
data3 = pd.read_sql_query(query3, engine)
data3.head()

                   title  film_id
0        ARMAGEDDON LOST       39
1    LADYBUGS ARMAGEDDON      507
2       METAL ARMAGEDDON      571
3    MOSQUITO ARMAGEDDON      598
4  STAGECOACH ARMAGEDDON      838

# Get 10 the longest films.

In [8]:
query4 = '''SELECT *
            FROM film
            ORDER BY length DESC
            LIMIT 10;'''
data4 = pd.read_sql_query(query4, engine)
data4.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,141,CHICAGO NORTH,A Fateful Yarn of a Mad Cow And a Waitress who...,2006,1,None,6,4.99,185,11.99,PG-13,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
3,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,2006,1,None,4,2.99,185,26.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
4,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42

# How many films include Behind the Scenes content?

In [9]:
query5 = '''SELECT special_features, COUNT(*)
            FROM film
            GROUP BY 1
            HAVING special_features LIKE '%%Behind the Scenes%%'
            ORDER BY 2;'''
data5 = pd.read_sql_query(query5, engine)
data5.head()

                                    special_features  COUNT(*)
0          Trailers,Deleted Scenes,Behind the Scenes        49
1  Trailers,Commentaries,Deleted Scenes,Behind th...        61
2      Commentaries,Deleted Scenes,Behind the Scenes        66
3                     Commentaries,Behind the Scenes        70
4                                  Behind the Scenes        70

# Which kind of movies (rating) have a mean duration of more than two hours?

In [10]:
query6 = '''SELECT rating, AVG(length) AS mean_length
FROM film
GROUP BY rating
HAVING AVG(length) > 120;'''

data6 = pd.read_sql_query(query6, engine)
data6.head()

  rating  mean_length
0  PG-13     120.4439

# Rank films by length (filter out the rows that have nulls or 0s in length    column). In your output, only select the columns title, length, and the rank.

In [11]:
query7 = '''SELECT title, length
FROM film
WHERE length != 0 and length IS NOT NULL
ORDER BY length DESC;'''

data7 = pd.read_sql_query(query7, engine)
data7.head()

            title  length
0   CHICAGO NORTH     185
1  CONTROL ANTHEM     185
2  DARN FORRESTER     185
3     GANGS PRIDE     185
4       HOME PITY     185